Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Otherwise, X is an array with the same number of dimensions as the sum of the dimensionalities of all the indices.
ja: そうでない場合は xは、すべての次元の次元性の合計と同じ数の次元を持つ配列です。 索引。

source: Otherwise, if the manifest stanza matching uuid has a git-tree-sha1 entry, compute a deterministic hash function of uuid and git-tree-sha1—call it slug—and look for packages/X/$slug in each directory in the Julia DEPOT_PATH global array.
ja: そうでない場合は、uuidに一致するマニフェストスタンザがgitツリーsha1エントリを持つ場合は、uuidの確定ハッシュ関数を計算して、の呼び出しを行います。

source: OurRational also provides several outer constructor methods for convenience.
ja: OurRationalには、便宜上、いくつかの外部コンストラクタメソッドも用意されています。

source: Outer Constructor Methods
ja: 外部コンストラクタのメソッド

source: Outer constructor methods can only ever create a new instance by calling another constructor method, such as the automatically provided default ones.
ja: 外部コンストラクタのメソッドは、新しいインスタンスを作成することしかできません。 別のコンストラクタ・メソッド(自動的に提供されるデフォルトのデフォルト値など)を呼び出します。

source: Outer constructors call inner constructors to actually make instances.
ja: 外部コンストラクタは内部コンストラクタを呼び出して実際に インスタンスを作成します。

source: Outer-only constructors
ja: 外部のみのコンストラクタ

source: Overflow behavior
ja: オーバーフロー処理

source: Overloading `show` allows one to indicate arbitrary multimedia representations (keyed by standard MIME types) of user-defined types.
ja: オーバロード`show`は、任意のマルチメディア表現を示すことができます(標準でキー設定されています)。 ユーザー定義型のMIMEタイプ。

source: Override the computation of the lazy broadcast's axes
ja: 遅延ブロードキャストの軸の計算をオーバーライドします。

source: Override the default lazy behavior within a fused expression
ja: 融合式の中でデフォルトの遅延動作をオーバーライドする

source: Package Development
ja: パッケージ開発

source: Package directories
ja: パッケージのディレクトリ

source: Package directories are handy when you have a set of packages that you just want to put somewhere and use them as they are, without having to create and maintain a project environment for them.
ja: パッケージのディレクトリは、単にどこかに配置したいパッケージのセットを持っていて、それらのパッケージをそのまま使用したり、プロジェクト環境を作成したり維持したりする必要がないようにする場合に便利です。

source: Package directories provide a kind of environment that approximates package loading in Julia 0.6 and earlier, and which resembles package loading in many other dynamic languages.
ja: パッケージ・ディレクトリは、Julia0.6以前のパッケージ・ロードに近似し、他の多くの動的言語でパッケージ・ロードに似た環境を提供します。

source: Package directories provide low-overhead convenience when a project environment isn't needed.
ja: パッケージディレクトリは、プロジェクト環境が不要な場合は、オーバーヘッドの少ないの利便性を提供します。

source: Package loading is built on top of code inclusion and is a lot more complex.
ja: パッケージのロードはコードインクルージョンの上に構築され、より複雑なものになります。

source: Package loading: e.g. import X or using X.
ja: パッケージ荷重:例えばインポートXまたはをXを使用する。

source: Packages from various registries are installed and managed using a common set of tools and workflows.
ja: さまざまなレジストリからのパッケージは、共通のツールとワークフローを使用してインストールされ、管理されます。

source: Packages in non-primary environments can end up using incompatible versions of their dependencies even if their own environments are entirely compatible.
ja: 非プライマリ環境でのパッケージは、独自の環境が完全に互換性がある場合でも、互換性のないバージョンの依存関係を使用することがあります。

source: Packages
ja: パッケージ

source: Packed structs and union declarations are not supported by Julia.
ja: Packed構造体とUnion宣言は、Juliaではサポートされていません。

source: Pair
ja: ペア

source: Parametric Constructors
ja: パラメトリックコンストラクタ

source: Parametric methods allow the same syntax as where expressions used to write types (see UnionAll Types).
ja: パラメトリックメソッドでは、型の作成に使用されるwhere式と同じ構文を使用できます（全合併型を参照）。

source: Parametric types add a few wrinkles to the constructor story.
ja: パラメトリック・タイプでは、コンストラクター・ストーリーにいくつかのしわが追加されます。

source: Parametrically-constrained Varargs methods
ja: パラメトリック制約付き可変引数メソッド

source: PartialQuickSort(k) is similar to QuickSort, but the output array is only sorted up to index k if k is an integer, or in the range of k if k is an OrdinalRange.
ja: PartialQuickSort(k)はQuickSortと類似していますが、出力配列はインデックスにのみソートされています。 kは、kが整数である場合、kがkの場合、kの範囲である。OrdinalRange。

source: Partly because of run-time type inference (augmented by optional type annotations), and partly because of a strong focus on performance from the inception of the project, Julia's computational efficiency exceeds that of other dynamic languages, and even rivals that of statically-compiled languages.
ja: 実行時型推論（任意の型注釈で補うこともできます）によって、またプロジェクト発足時からの性能に対する強い欲求によって、Juliaの計算効率は他の動的言語を圧倒し、静的コンパイル言語と競うレベルにあります。

source: Partly because of run-time type inference (augmented by optional type annotations), and partly because of a strong focus on performance from the inception of the project, Julia’s computational efficiency exceeds that of other dynamic languages, and even rivals that of statically-compiled languages.
ja: 実行時型推論（任意の型注釈で補うこともできます）によって、またプロジェクト発足時からの性能に対する強い欲求によって、Juliaの計算効率は他の動的言語を圧倒し、静的コンパイル言語と競うレベルにあります。

source: Passing Pointers for Modifying Inputs
ja: 入力を変更するためのポインタを渡す

source: Passing options to julia in so-called shebang by, e.g., !/usr/bin/env julia --startup-file=no may not work in some platforms such as Linux.
ja: 例えば、シェバンでは、julyに渡すオプションを指定します。 !/usr/bin/env julia--startup file=noは動作しない場合があります。 Linuxなどのプラットフォームです。

source: Perhaps the best way to tie all these pieces together is to present a real world example of a parametric composite type and its constructor methods.
ja: これらすべてを結びつける最良の方法は、実際の例を提示することである。 パラメトリック複合型とそのコンストラクタメソッドです。

source: Perhaps you've defined a type and then realize you need to add a new field.
ja: おそらく、タイプを定義してから、新しいフィールドを追加する必要があることを認識しています。

source: Pointers contained in C structs should be represented as fields of type Ptr{T} within the corresponding Julia struct types designed to mimic the internal structure of corresponding C structs.
ja: Cに含まれるポインタ 構造体は、対応するジュリア構造内のPtr{T}の型のフィールドとして表されるべきである。 は、対応するC構造体の内部構造を模倣するように設計されています。

source: Point{T}, for each possible type T<:Real, that behaves just like non-parametric default inner constructors do.
ja: 点{T}は、それぞれの可能なタイプT<:Realに対して は、非パラメトリックデフォルトのインナーコンストラクタと同じように動作します。

source: Positive zero is equal but not greater than negative zero.
ja: 正のゼロは負のゼロに等しいですが、大きくはありません。

source: Powerful shell-like capabilities for managing other processes
ja: シェルのような強力なプロセス管理 n

source: Powers, logs and roots
ja: 冪乗、対数、冪乗根

source: Practical use of it requires using llvmcall.
ja: 実用化 リウムカルを使用する必要があります。

source: Precedence rules for mixing styles
ja: スタイルをミキシングするための優先順位規則

source: Print this message
ja: このメッセージを印刷する

source: Priv package—the one with UUID 2d15fe94-a1f7-436c-a4d8-07a9a496e01c—it finds its stanza in the manifest, see that it does not have a path entry, but that it does have a git-tree-sha1 entry.
ja: Privpackage-UUID2d15fe94-a1f7-436c-a4d8-07a9a496e01c-itは、マニフェスト内のスタンザを検出します。これは、はのパスのエントリを持っていませんが、gitツリーsha1エントリを持っていることを示しています。

source: Program representation
ja: プログラム表現

source: Project environments
ja: プロジェクト環境

source: Project environments provide reproducibility. By checking a project environment into version control—e.g. a git repository—along with the rest of the project's source code, you can reproduce the exact state of the project and all of its dependencies since the manifest file captures the exact version of every dependency.
ja: プロジェクト環境は、再現性を提供します。プロジェクト環境をバージョン制御することによって<x/>は、プロジェクトのソースコードとともに、プロジェクトの正確な状態を再現できます。は、すべての依存関係の正確なバージョンをキャプチャするため、すべての依存関係の正確な状態を再現できます。

source: Provided the element type of the array is compatible with BLAS, a strided array can utilize BLAS and LAPACK routines for more efficient linear algebra routines.
ja: 配列の要素タイプがBLASと互換性がある場合、strider配列はBLASとLAPACKルーチンを利用することができます。 より効率的な線形代数のルーチンです。

source: Ptr is always a word-size primitive type.
ja: Ptrは常にワードサイズのプリミティブ型である。

source: Ptr{Any} (Ref{Any} is invalid as a return type)
ja: Ptr{Any}(Ref{Any}は、戻り型として無効です)

source: Ptr{Cvoid} (you may need to use `@cfunction` explicitly to create this pointer)
ja: Ptr{Cvoid}(このポインタを作成するためには、`@cfunction`を明示的に使用する必要があります)

source: Ptr{T}, where T is the Julia type corresponding to T
ja: Ptr{T}。ここで、Tは、Tに対応するジュリア型である。

source: QuickSort is an O(n log n) sorting algorithm which is in-place, very fast, but not stable – i.e. elements which are considered equal will not remain in the same order in which they originally appeared in the array to be sorted.
ja: QuickSortはO(nログn)ソートアルゴリズムで、インプレースではなく、非常に高速ですが、安定しています。 すなわち、等しいと考えられる要素は、本来は同じ順序では存在しない 配列に表示され、ソートされます。

source: QuickSort is selected as it is faster and indistinguishable in this case from a stable sort (unless the array records its mutations in some way).
ja: クイックソートが選択されると同時に選択され、識別できなくなります。 この場合は、安定なソート(配列が何らかの方法でその突然変異を記録しない限り)である。

source: Quiet startup: no banner, suppress REPL warnings
ja: quietスタートアップ:バナーがない、REPL警告が省略されていない

source: QuoteNode can also be used for certain advanced metaprogramming tasks.
ja: QuoteNodeは、特定の高度なメタプログラミング・タスクにも使用できます。

source: Quoting
ja: 見積り

source: Range indexing makes a copy of the selected part of the original string.
ja: 範囲によるインデックスは、元の文字列のうち、選択された部分のコピーを作ります。

source: Ranges in generators and comprehensions can depend on previous ranges by writing multiple for
ja: 生成の範囲は、をに書くことによって、以前の範囲に依存することができる。

source: Ranges like a:c or a:b:c, which select contiguous or strided subsections from a to c (inclusive)
ja: a:cまたはa:bのような範囲。から(含む)まで連続するサブセクションまたはストライドされたサブセクションを選択する。

source: Rather than relying on "vectorized" methods of functions like sin
ja: sinのような"ベクトル化された"関数の関数に依存するのではなく

source: Rational Numbers
ja: 有理数

source: Rational Numbers -- its entire behavior is defined in these few lines.
ja: Rational Number--その動作全体は、これらの数行で定義されています。

source: Rationals are constructed using the `//` operator:
ja: 合理性を構築する `//`演算子を使用します。

source: Rationals can easily be converted to floating-point numbers:
ja: 合理化は、簡単に浮動小数点数に変換できます。

source: Recall from (@ref man-functions) that a function is an object that maps a tuple of arguments to a return value, or throws an exception if no appropriate value can be returned.
ja: 関数の章を思い出してください。関数とは、引数のタプルを受け取り、戻り値を返す、または適切な値が返せない場合は例外を投げる、オブジェクトです。

source: Recall from Parametric Types
ja: パラメトリックタイプからリコールされます。

source: Recall that the variable ans is set to the value of the last expression evaluated in an interactive session.
ja: 変数`は、最後に評価された最後の式の値に設定されていることを思い出してください。 対話型セッションです。

source: Recall that the variable `ans` is set to the value of the last expression evaluated in an interactive session.
ja: 前述の通り、変数 ans は対話セッションで最後に出力された式の値がセットされます。

source: Ref{T}, where T is the Julia type corresponding to T
ja: 参照{T}。Tは、Tに対応するジュリア型である。

source: Represented as either an array or a struct.
ja: 配列または構造体として表されます。

source: Required Methods
ja: 必要なメソッド

source: Required methods
ja: 必要なメソッド

source: Resources
ja: リソース

source: Return a mutable array with the same element type and size dims
ja: 同じ要素タイプとサイズを持つ可変配列を返すディムス

source: Return a mutable array with the same shape and element type
ja: 同じシェイプとエレメントタイプを持つ可変配列を返します。

source: Return a mutable array with the same shape and the specified element type
ja: 同じ形状および指定された要素タイプを持つ可変配列を返します。

source: Return a mutable array with the specified element type and size
ja: 指定されたエレメントタイプとともに、可変配列を返します。

source: Return a mutable array with the specified indices inds (see below)
ja: 指定されたインデックスインスタンス(以下参照)を使用して、可変配列を返します。

source: Return an array similar to T with the specified indices inds (see below)
ja: Tのような配列を指定されたインデックスinds(以下参照)と同様に返す。

source: Return the AbstractUnitRange of valid indices
ja: 有効なインデックスのAbstractUnitRangeを返します。

source: Return the distance in memory (in number of elements) between adjacent elements in dimension k.
ja: 寸法kの隣り合う要素間のメモリ内の距離(要素数)を返します。

source: Return the distance in memory (in number of elements) between adjacent elements in each dimension as a tuple.
ja: 各次元内の隣り合う要素間の距離をタプルとして、メモリ内の距離を返します(要素数)。

source: Return the native address of an array.
ja: 配列のネイティブ・アドレスを返します。

source: Return type
ja: 戻り値の型

source: Return type (see below for mapping the declared C type to Julia)
ja: 戻り型(宣言されたC型をJuliaにマッピングするには、次を参照)

source: Returning to the sequence of squares from above, we could instead define it as a subtype of an AbstractArray{Int, 1}:
ja: 上からの2乗のシーケンスに戻ると、それをサブタイプとして定義することができます。 AbstractArray{Int,1}:

source: Returns a tuple containing the dimensions of A
ja: Aの次元を含むタプルを返します。

source: Returns either IndexLinear() or IndexCartesian().
ja: IndexLinear()またはIndexCartesian()のいずれかを返します。

source: Returns either a tuple of the first item and initial state or `nothing` if empty
ja: 最初の項目と初期状態のタプルを返すか、'nothing""のいずれかを返します。

source: Returns either a tuple of the next item and next state or nothing if no items remain
ja: 次の項目のタプルを返し、次の状態または何もしないを返します。項目が残っていない場合は、<x/>

source: Right
ja: 右

source: Rounding functions
ja: 丸め関数

source: Rounding modes
ja: 丸めモード

source: Run processes on hosts listed in <file>
ja: <file>にリストされたホスト上でプロセスを実行する

source: Run processes on hosts listed in
ja: にリストされたホスト上でプロセスを実行する

source: Running a Julia script using julia file.jl does not throw `InterruptException` when you try to terminate it with CTRL-C (SIGINT).
ja: ジュリアファイル.jlを使用してジュリアスクリプトを実行しても、スローされません。 CTRL-Cで終了しようとすると、'InterruptException'となります。 (SIGINT)。

source: SIMD Values
ja: SIMD値

source: Scalar values passed to these functions are treated as 1-element arrays.
ja: これらの関数に渡されるスカラー値は、1要素配列として扱われます。

source: Scalar values passed to these functions are treated as 1-element arrays. For example,
ja: これらの関数に渡されるスカラー値は、1要素配列として扱われます。たとえば、次のようになります。

source: Scientific computing has traditionally required the highest performance, yet domain experts have largely moved to slower dynamic languages for daily work.
ja: 科学技術計算には常に最高の性能が求められますが、この分野のエキスパートたちはより低速な動的言語を使って仕事をしています。

source: Search docs
ja: ドキュメントを検索

source: See the (@ref man-multi-dim-arrays) and the (@ref lib-arrays) for more supported methods.
ja: 「」を参照してください。 サポートされるメソッドについては、(@ref manマルチdimアレイ)および(@ref lib arrays)を参照してください。

source: See Scope of Variables for a detailed explanation of variable scope and how it works in Julia.
ja: 変数のスコープとJuliaでの動作の詳細については、変数のスコープを参照してください。

source: See (@ref conversion-and-promotion) for details of the promotion system.
ja: プロモーションシステムの詳細については 変換とプロモーション(@ref conversion-and-promotion)を参照ください。

source: See (@ref conversion-and-promotion) for how to define your own conversions and promotions.
ja: 独自の変換とプロモーションの定義方法については、(@ref conversion-and-promotion) を参照してください

source: See (@ref scope-of-variables) for a detailed explanation of variable scope and how it works in Julia.
ja: 可変スコープの詳細な説明およびそれがどのように動作するかについては、(変数の@ref scope of variables)を参照してください。 ジュリア。

source: See Iteration below, and for some more advanced examples, see this blog post on multidimensional algorithms and iteration.
ja: 以下の「イテレーション」を参照してください。また、詳細については、以下を参照してください。 例を参照してください。このブログ記事は、多次元アルゴリズムに関するこのブログ記事を参照してください。 繰り返し。

source: See also (@ref man-scripting) for more information on writing Julia scripts.
ja: Juliaスクリプトの記述についての詳細は、(@ref man scripting)も参照してください。

source: See also the (@ref man-vectorized); for example, f.(args...) implicitly calls broadcast(f, args...).
ja: (@ref man-vectorized)も参照してください。 たとえば、f.(args...)は暗黙的にブロードキャスト(f,args.…)を呼び出します。

source: See the (@ref man-interface-array) for more details on implementing a custom array type.
ja: 詳細については、(@ref man interface array)を参照してください。 カスタム・アレイ・タイプの実装です。

source: See the (@ref man-interface-iteration) for more details about defining a custom iterable type.
ja: カスタムを定義する方法の詳細については、(@ref man interface iteration)を参照してください。 iterable型。

source: See the description below.
ja: 以下の説明を参照してください。

source: Selecting an appropriate output array
ja: 適切な出力配列を選択する

source: Selecting an appropriate output array for the given set of arguments
ja: 指定された引数のセットに対して適切な出力配列を選択する

source: Selecting an efficient implementation for the given set of arguments
ja: 指定された引数のセットに対する効率的な実装の選択

source: Sequential iteration is implemented by the `iterate` function.
ja: 逐次的反復は、'reiterate'関数によって実装される。

source: Set <dir> as the home project/environment.
ja: <dir>をホームプロジェクト/環境として設定します。

source: Set as the home project/environment.
ja: をホームプロジェクト/環境として設定します。

source: Set location of julia executable
ja: ジュリア実行可能ファイルの場所を設定します。

source: Set the optimization level (default level is 2 if unspecified or 3 if used without a level)
ja: デバッグ情報の生成レベルを有効/設定します(デフォルトレベルは、指定されていない場合は1、レベルなしでは2を指定します)。

source: Shared libraries and functions are referenced by a tuple of the form (:function, "library")
ja: 共有ライブラリと関数は、(:関数、"ライブラリ")という形式のタプルによって参照されます。

source: Short, simple function definitions are common in Julia.
ja: こうした短くて簡単な関数定義は、Juliaではよく使われます。

source: Short-circuit evaluation is quite similar to conditional evaluation.
ja: 短絡評価は条件付き評価と非常によく似ています。

source: Sign and absolute value functions
ja: 符号および絶対値関数

source: Similarly for unary operators like ! or √, there is a corresponding .√ that applies the operator elementwise.
ja: 単項についても同様 !や√x20/>のような演算子は、対応する<X21/>.√となります。 は、演算子要素を適用します。

source: Similarly, for array arguments (T[] or T*), the Julia type should again be Ptr{T}, not Vector{T}.
ja: 同様に、配列引数(T[]またはT*)では、次のようになります。 また、Julia型は、再びPtr{T}であり、ベクトル{T}ではない。

source: Similarly, indexing by a N-dimensional boolean array is effectively the same as indexing by the vector of CartesianIndex{N}s where its values are true.
ja: 同様にインデックス化 N-次元ブール配列は、実効的には、以下のように、インデックス化と同じである。 CartesianIndex{N}sのベクトルであり、その値は真である。

source: Similarly, instead of if !
ja: 同様に、 if ！

source: Similarly, some subtypes may wish to override (@ref Base.Multimedia.redisplay).
ja: 同様に、サブタイプによっては、(@ref Base.Multimedia.redisplay)をオーバーライドすることを希望する場合もあります。

source: Similarly, such operators are assigned associativity :none.
ja: 同様に、このような演算子には、関連付け:なしが割り当てられています。

source: Similarly, you can completely override out-of-place broadcasting with a copy(::Broadcasted)
ja: 同様に、コピー(:ブロードキャスト)を使用して、場所を指定しないブロードキャストを完全に上書きできます。

source: Simple blocks:
ja: 単純なブロック:

source: Since gcd returns the greatest common divisor of its arguments with sign matching the first argument (den here), after this division the new value of den is guaranteed to be non-negative.
ja: 以降 gcdは、最初の引数と一致する符号を持つ引数の最大公約数を返します。 (denここで)この除算の後、denの新しい値は負ではないことが保証されます。

source: Since Zebra does not appear in the project file, the import will fail even though Zebra
ja: プロジェクトファイルにZebraが表示されないため、Zebraであってもインポートは失敗します。

source: Since adding dots to many operations and function calls in an expression can be tedious and lead to code that is difficult to read, the macro (@ref @dot) is provided to convert every function call, operation, and assignment in an expression into the "dotted" version.
ja: 式の多くの操作と関数呼び出しにドットを追加することで は退屈で、読むのが難しいコードにつながり、マクロを読み取ることができない (@ref@ドット)は、すべての関数呼び出しを変換するために提供されます。 「ドット」バージョンへの式での操作および割り当て。

source: Since all packages in a package directory environment are, by definition, subdirectories with the expected entry-point files, their paths map entries always have this form.
ja: パッケージディレクトリ環境内のすべてのパッケージは、定義上、期待されるエントリポイントファイルを持つサブディレクトリであるため、それらのパスマップエントリは常にこの形式を持っています。

source: Since code is represented by objects that can be created and manipulated from within the language, it is possible for a program to transform and generate its own code.
ja: コードが表現されるため 言語内で作成および操作できるオブジェクトがあります。 独自のコードを変換して生成するプログラムです。

source: Since counting up and down like the above while loop does is so common, it can be expressed more concisely with a for loop:
ja: カウントアップして ループは非常に一般的であるので、上記のようにダウンすることができる。 ループの場合は:

source: Since expressions are just Expr objects which can be constructed programmatically and then evaluated, it is possible to dynamically generate arbitrary code which can then be run using `eval`.
ja: 式は、プログラム的に構築されて評価されることができる、単純なExprオブジェクトであるからです。 任意のコードを動的に生成して、`eval'を使用して実行することができます。

source: Since function definitions can be entered into interactive sessions, it is easy to compare these definitions:
ja: 対話セッションでも関数の定義を入力できるので、簡単に定義の比較ができます。

source: Since indexing is such an important part of an array and often occurs in hot loops, it's important to make both indexing and indexed assignment as efficient as possible.
ja: インデックス作成は このような重要な部分は、多くの場合、ホット・ループで発生するため、両方とも重要です。 インデックス化とインデックス化された割り当ては可能な限り効率的です。

source: Since outer constructor methods can only create objects by calling other constructor methods, ultimately, some inner constructor must be called to create an object.
ja: 外部コンストラクタ メソッドは、他のコンストラクタ・メソッドを呼び出してオブジェクトを作成できるだけで、最終的には内部コンストラクタを作成できます オブジェクトを作成するために呼び出される必要があります。

source: Since the body of the generated function is non-deterministic, its behavior, and the behavior of all subsequent code
ja: 生成された関数の本体は決定的ではないので、その振る舞いは、と、その後のすべてのコードの振る舞いとなります。

source: Since the decentralized naming problem is somewhat abstract, it may help to walk through a concrete scenario to understand the issue.
ja: 分散ネーミング問題は幾分抽象的なので、この問題を理解するためには、具体的なシナリオをウォークスルーすることが有用です。

source: Since the fundamental difficulty may not be immediately obvious, let us briefly explain it.
ja: 根本的な困難はすぐにはない わかりやすく説明しましょう。

source: Since the method declaration restricts the arguments to being of the same type, calls like Point(1,2.5), with arguments of different types, result in "no method" errors.
ja: メソッド宣言によって引き数が制限されるため 同じタイプで、ポイント(1,2.5)のような呼び出しがあり、さまざまなタイプの引数がある場合は、「メソッドなし」となります。 エラーです。

source: Since the primary environment is typically the environment of a project you're working on, while environments later in the stack contain additional tools, this is the right tradeoff: it's better to break your dev tools but keep the project working.
ja: 一般的な環境は、作業中のプロジェクトの環境ですが、その後にスタックの追加ツールが追加されます。これは適切なトレードオフです。開発ツールを中断しても、プロジェクトの機能を維持したほうがよいのです。

source: Since these are fairly small, simple expressions, they could easily be placed onto a single line, which is where the (;) chain syntax comes in handy:
ja: これらはかなり小さいので、簡単な表現で簡単に1行に配置することができます。 ここでは、(;)チェイン構文が便利です。

source: Since these two Priv packages are different but both required for App to continue working correctly, the expression import Priv must refer to different Priv packages depending on whether it occurs in App's code or in Pub's code.
ja: これらの2つのPrivパッケージは異なりますが、Appは正常に動作するためには必要です。import Privは、ののコードで発生するか、PubPubのコードで発生するかによって、Privの異なるを参照しなければなりません。x39。

source: Smallest value
ja: 最小値

source: So -2x is parsed as (-2) * x and √2x is parsed as (√2) * x.
ja: -2xは(-2)*xと解析され、は(√2)×xと解析され、となる。

source: So 2^3x is parsed as 2^(3x), and 2x^3 is parsed as 2*(x^3).
ja: 2^3x は 2^(3x),として 解析され、2x^3 は 2*(x^3)として解析されます。:

source: So, the method body that will be used here doesn't include a loop at all - just indexing into the two tuples, multiplication and addition/subtraction.
ja: このため、ここで使用されるメソッド本体はループを一切含まず、単にインデックス作成するだけです。 2つのタプル、乗算と加算、減算。

source: So, we could have defined the test function above as
ja: そのため、上記のtest関数は、このようにも定義できます。

source: Some C libraries execute their callbacks from a different thread, and since Julia isn't thread-safe you'll need to take some extra precautions.
ja: Cライブラリの中には、別のスレッドからコールバックを実行するものもあれば、スレッドセーフではないものもあります。 さらに注意する必要があります。

source: Some Examples of C Wrappers
ja: Cラッパーのいくつかの例

source: Some examples:
ja: いくつかの例を次に示します。

source: Some functions have both modifying (e.g., sort!) and non-modifying (sort) versions.
ja: 関数の中には、修正(例えばソート!)や修正されない(ソート)バージョンの両方があるものがあります。

source: Some general notes:
ja: 一般的な注意事項は次のとおりです。

source: Some operations that should not be attempted include:
ja: 試行されるべきでない操作には、次のものがあります。

source: Sometimes extra parentheses around the argument to : are needed to avoid ambiguity in parsing.:
ja: 構文解析のあいまいさを避けるために、:への引数を囲む余分な括弧が必要になる場合があります。

source: Sometimes invariants must be enforced, either by checking arguments or by transforming them.
ja: 時には、引数をチェックすることによって、変数を強制する必要があります。 変えることです。

source: Sometimes it is convenient to have a single expression which evaluates several subexpressions in order, returning the value of the last subexpression as its value.
ja: いくつかのサブ式を評価する単一の表現を持つことが便利な場合もあります。 は、最後のサブ式の値をその値として返します。
